In [1]:
import pandas as pd
num = 0
for data in  pd.read_csv("employees_202206172332.csv", chunksize = 5000 ):
    num = num+1
    name = 'emps_'+str(num)+'.csv'
    #data.to_csv(name, index=False)
    #print(name, 'loaded')

In [2]:
import glob
path = r'D:\Code_Place\Data-Science\PySpark_SparkSql\files' # use your path
filenames = glob.glob(path + "/*.csv")
df = pd.concat(map(pd.read_csv, filenames))
df.head()

   emp_no emp_title_id  birth_date  first_name  last_name gender   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco      M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande      F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb      F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff      M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann      F  1991-01-18

In [3]:
print(len(df))

300024

In [4]:
df['Full Name'] = df['first_name'] +' '+ df['last_name'].map(str)
df = df.drop(['first_name','last_name'], axis=1)
df.head()

   emp_no emp_title_id  birth_date gender   hire_date           Full Name
0  473302        s0001  1953-07-25      M  1990-04-28   Hideyuki Zallocco
1  475053        e0002  1954-11-18      F  1991-09-07     Byong Delgrande
2   57444        e0002  1958-01-30      F  1992-03-21          Berry Babb
3  421786        s0001  1957-09-28      M  1987-11-26      Xiong Verhoeff
4  282238        e0003  1952-10-28      F  1991-01-18  Abdelkader Baumann

In [12]:
df.notnull()

data[10:25]

,emp_no,emp_title_id,birth_date,first_name,last_name,gender,hire_date
300010,256651,e0003,1962-07-18,Oksana,Alameldin,F,1987-06-19
300011,417966,s0001,1952-03-01,Tristan,Msuda,F,1987-02-11
300012,202478,e0003,1956-11-16,Xiaoheng,Michaels,M,1991-07-27
300013,260220,e0003,1957-05-04,Navin,Siegrist,M,1985-07-27
300014,81057,e0003,1957-11-03,Patricio,Pocchiola,M,1985-02-16
300015,26881,s0001,1952-09-28,Jiafu,Petersohn,M,1991-06-27
300016,99439,s0001,1963-02-02,Mahmut,Manders,M,1985-09-26
300017,225587,s0002,1952-08-05,Chenyi,Orlowska,M,1986-12-25
300018,229498,e0002,1952-12-06,Jagoda,Molberg,F,1987-01-02
300019,464231,s0001,1958-08-14,Constantino,Eastman,M,1988-10-28
300020,255832,e0002,1955-05-08,Yuping,Dayang,F,1995-02-26
300021,76671,s0001,1959-06-09,Ortrud,Plessier,M,1988-02-24
300022,264920,s0001,1959-09-22,Percy,Samarati,F,1994-09-08
300023,464503,s0002,1964-05-31,Arvind,Slobodova,M,1987-11-23

In [46]:
names = df.columns.to_list()
names

['emp_no', 'emp_title_id', 'birth_date', 'gender', 'hire_date', 'Full Name']

In [49]:
df = df[['emp_no', 'Full Name', 'gender', 'hire_date']]
df.head()

   emp_no           Full Name gender   hire_date
0  473302   Hideyuki Zallocco      M  1990-04-28
1  475053     Byong Delgrande      F  1991-09-07
2   57444          Berry Babb      F  1992-03-21
3  421786      Xiong Verhoeff      M  1987-11-26
4  282238  Abdelkader Baumann      F  1991-01-18

In [51]:
df.to_json('emp.json', orient='records',indent=4,lines=True)

In [14]:
# importing pandas as pd
import pandas as pd

# importing numpy as np
import numpy as np

# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
		'Second Score': [30, np.nan, 45, 56],
		'Third Score':[52, 40, 80, 98],
		'Fourth Score':[np.nan, np.nan, np.nan, 65]}

# creating a dataframe from dictionary
df = pd.DataFrame(dict)

print(df)
# using dropna() function

print(df.dropna())

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0
   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

In [16]:
# dictionary of lists
dict = {'First Score':[100, np.nan, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, np.nan, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
df = pd.DataFrame(dict)
print(df)
# using dropna() function   
df.dropna(how = 'all')

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
1          NaN           NaN          NaN           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0         52.0           NaN
2          NaN          45.0         80.0           NaN
3         95.0          56.0         98.0          65.0